## Ordinal encoding

- The labels can be ordered 
- Assign numbers to categories 

### Pros

- Keeps variables semantic 
- Easy

In [28]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np
import datetime

In [29]:
from google.colab import drive
drive.mount('/content/gdrive')
data = pd.read_csv("gdrive/My Drive/Colab Notebooks/FeatureEngineering/train_date.csv")

Drive already mounted at /content/gdrive; to attempt to forcibly remount, call drive.mount("/content/gdrive", force_remount=True).

In [30]:
data.head()

         Date  PassengerId  Survived  ...     Fare Cabin Embarked
0   12/6/2019            1         0  ...   7.2500   NaN        S
1   12/7/2019            2         1  ...  71.2833   C85        C
2   12/8/2019            3         1  ...   7.9250   NaN        S
3   12/9/2019            4         1  ...  53.1000  C123        S
4  12/10/2019            5         0  ...   8.0500   NaN        S

[5 rows x 13 columns]

In [31]:
data.columns

Index(['Date', 'PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age',
       'SibSp', 'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [32]:
data['Date'] = pd.to_datetime(data['Date'])
data.head()

        Date  PassengerId  Survived  ...     Fare Cabin Embarked
0 2019-12-06            1         0  ...   7.2500   NaN        S
1 2019-12-07            2         1  ...  71.2833   C85        C
2 2019-12-08            3         1  ...   7.9250   NaN        S
3 2019-12-09            4         1  ...  53.1000  C123        S
4 2019-12-10            5         0  ...   8.0500   NaN        S

[5 rows x 13 columns]

In [33]:
type(data['Date'][0])

pandas._libs.tslibs.timestamps.Timestamp

In [34]:
data['Date'][0].weekday

In [35]:
data['year'] = pd.DatetimeIndex(data['Date']).year

In [36]:
data.head()

        Date  PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked  year
0 2019-12-06            1         0       3  ...   7.2500   NaN         S  2019
1 2019-12-07            2         1       1  ...  71.2833   C85         C  2019
2 2019-12-08            3         1       3  ...   7.9250   NaN         S  2019
3 2019-12-09            4         1       1  ...  53.1000  C123         S  2019
4 2019-12-10            5         0       3  ...   8.0500   NaN         S  2019

[5 rows x 14 columns]

In [37]:
data['day'] = pd.DatetimeIndex(data['Date']).day

In [38]:
data.head()

        Date  PassengerId  Survived  Pclass  ... Cabin Embarked  year  day
0 2019-12-06            1         0       3  ...   NaN        S  2019    6
1 2019-12-07            2         1       1  ...   C85        C  2019    7
2 2019-12-08            3         1       3  ...   NaN        S  2019    8
3 2019-12-09            4         1       1  ...  C123        S  2019    9
4 2019-12-10            5         0       3  ...   NaN        S  2019   10

[5 rows x 15 columns]

In [39]:
data.isnull().sum()

Date             0
PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
year             0
day              0
dtype: int64

In [40]:
data.year.unique()

array([2019, 2020, 2021, 2022])

In [41]:
from sklearn.preprocessing import OrdinalEncoder
encoder = OrdinalEncoder()
temp = encoder.fit_transform(data['year'].values.reshape(-1,1))

In [42]:
data['year'] = temp

In [43]:
data.head()

        Date  PassengerId  Survived  Pclass  ... Cabin Embarked  year  day
0 2019-12-06            1         0       3  ...   NaN        S   0.0    6
1 2019-12-07            2         1       1  ...   C85        C   0.0    7
2 2019-12-08            3         1       3  ...   NaN        S   0.0    8
3 2019-12-09            4         1       1  ...  C123        S   0.0    9
4 2019-12-10            5         0       3  ...   NaN        S   0.0   10

[5 rows x 15 columns]

In [44]:
data.year.unique()

array([0., 1., 2., 3.])